[
    {
        "id": 1,
        "name": "So'z",
        "submenu": [
            {
                "id": 1,
                "name": "Ta'rif va mezonlar",
                "content": "\n                <b>So‘zlar va ularning ta’riflari:</b><br>\n                <i>\n                    <ol>\n                        <li>\n                            - So'zlar tilning asosiy birliklari bo'lib, ular ma'noga ega bo'lib, ular birikishi mumkin.\n                        </li>\n                        <li>\n                            - So'z odatda tushuncha yoki fikrni ifodalovchi harflar yoki tovushlar ketma-ketligidir.\n                        </li>\n                        <li>\n                            - So‘zlarni turli bo‘laklarga bo‘lish mumkin, ya’ni ot, fe’l, sifat, ergash gap, olmosh, yuklama, bog‘lovchi, kesim bo‘lib, har biri ma’lum grammatik vazifani bajaradi.\n                        </li>\n                        <li>\n                            - So'zning ta'rifi ko'pincha uning kontekstiga bog'liq, chunki so'zlar bir nechta ma'no yoki nuanslarga ega bo'lishi mumkin.\n                        </li>\n                    </ol>\n                </i>\n            \n                \n                <b>So‘zlarni aniqlash mezonlari:</b><br>\n                <i>\n                    <ol>\n                        <li>\n                            - <b>Orfografik mezon</b>: so'zlar ko'pincha yozma tildagi boshqa so'zlardan ajratib turadigan bo'shliqlar yoki tinish belgilari bilan belgilanadi.\n                        </li>\n                        <li>\n                            - <b>Fonetik mezon</b>: Og'zaki nutqda so'zlar odatda pauza yoki intonatsiya va urg'u naqshlarining o'zgarishi bilan ajralib turadi.\n                        </li>\n                        <li>\n                            - <b>Leksik mezonlar</b>: So‘zlarning lug‘atlarda o‘ziga xos leksik yozuvlari mavjud bo‘lib, ularda ta’riflar, talaffuzlar va ba’zan foydalanish misollari keltirilgan.\n                        </li>\n                    </ol>\n                </i>\n                \n            \n                <b>So‘z yaratish jarayonlari:</b>\n                <i>\n                    <ol>\n                        <li>\n                            - <b>Tuzatish</b>: Yangi so‘zlar mavjud so‘zlarga old qo‘shimcha yoki qo‘shimcha qo‘shish orqali hosil bo‘ladi. Misol uchun, <mark>\"happy\"</mark> ga <mark>\"un-\"</mark> qo'shilishi <mark>\"unhappy\"</mark> ni hosil qiladi.\n                        </li>\n                        <li>\n                            - <b>Qo‘shma gap</b>: Ikki yoki undan ortiq mustaqil so‘zlarni birlashtirib so‘z yasalishi mumkin. Masalan, <mark>\"book\"</mark> va <mark>\"shelf\"</mark> birlashib, <mark>\"bookshelf\"</mark> hosil qiladi.\n                        </li>\n                        <li>\n                            - <b>Konvertatsiya</b>: Mavjud so'zlar nutq qismini hech qanday affikssiz o'zgartirishi mumkin. Masalan, <mark>\"run\"</mark> fe'l (<mark>\"She runs\"</mark>) yoki ot (<mark>\"She went for a run\"</mark>) bo'lishi mumkin.\n                        </li>\n                        <li>\n                            - <b>Qirqim</b>: Bir yoki bir nechta bo'g'inni olib tashlash orqali so'zlarni qisqartirish mumkin. Masalan, <mark>\"advertisement\"</mark> <mark>\"ad\"</mark>ga aylanadi yoki <mark>\"mathematics\"</mark>  <mark>\"math\"</mark> ga aylanadi.\n                        </li>\n                        <li>\n                            - <b>Aralashtirish</b>: Ikki yoki undan ortiq so‘z tovushlarini bir-biriga qo‘shish va birlashtirish orqali birlashtirilishi mumkin. Masalan, <mark>\"breakfast\"</mark> va <mark>\"launch\"</mark> birlashib, <mark>\"brunch\"</mark>ni tashkil qiladi.\n                        </li>\n                        <li>\n                            - <b>Qisqartmalar va initializmlar</b>: so'zlar iboraning yoki tashkilot nomining bosh harflaridan tuzilishi mumkin. Masalan, <mark>\"NASA\"</mark> (Aeronavtika va kosmik tadqiqotlar milliy boshqarmasi) yoki <mark>\"RADAR\"</mark> (Radio Detection and Ranging).\n                        </li>\n                    </ol>\n                </i>\n            \n                <b>So'zdan foydalanish:</b>\n                <i>\n                    <ol>\n                        <li>\n                            - <b>Ro'yxatdan o'tish</b>: so'zlar kontekst yoki registrda qo'llanilganiga qarab rasmiyatchilik yoki moslik jihatidan farq qilishi mumkin. Misol uchun, <mark>\"beneath\"</mark> <mark>\"underneath\"</mark> ko'ra ko'proq rasmiy.\n                        </li>\n                        <li>\n                            - <b>Konnotatsiya</b>: So'zlar ular bilan bog'liq bo'lgan ijobiy, salbiy yoki neytral ma'noga ega bo'lishi mumkin, ularning hissiy yoki ijtimoiy ta'siriga ta'sir qiladi. Masalan, <mark>\"stubborn\"</mark> so‘zi salbiy ma’noga ega bo‘lsa, <mark>\"resilient\"</mark> so‘zi ijobiy ma’noga ega.\n                        </li>\n                        <li>\n                            - <b>Kollokatsiya</b>: Ayrim so'zlar tez-tez birga kelib, birikma hosil qiladi. Masalan, <mark>\"make a decision\"</mark> yoki <mark>\"take a shower.\"</mark>. Umumiy birikmalarni bilish tabiiy tovushli tildan foydalanish uchun muhimdir.\n                        </li>\n                    </ol>\n                </i>\n                "
            }
        ]
    },
    {
        "id": 2,
        "name": "Gap",
        "submenu": [
            {
                "id": 1,
                "name": "Ta'rifi va turlari",
                "content": "\n                    <b>Gap ta'rifi va turlari:</b>\n                    <i>\n                        <ol>\n                            <li>\n                                - Gap tildagi to‘liq fikr yoki fikrni ifodalovchi grammatik birlikdir.\n                            </li>\n                            <li>\n                                - ma'lum bir tartibda tuzilgan va ma'noni bildiruvchi so'zlar turkumidan iborat.\n                            </li>\n                            <li>\n                                - Gap odatda sub'ektni (jumla kim yoki nima haqida) va predikatni (sub'ektning harakati yoki holatini) o'z ichiga oladi.\n                            </li>\n                            <li>\n                                - Gaplarni tuzilishi va maqsadiga ko‘ra turli turlarga bo‘lish mumkin.\n                            </li>\n                        </ol>\n                    </i>\n                    \n                    <b>Gap turlari:</b>\n                    <i>\n                        <ol>\n                            <li>\n                                - <b>Deklarativ jumlalar:</b> Bu jumlalar bayonot beradi yoki ma'lumot beradi. Ular davr bilan tugaydi. Misol: <mark>\"She is reading a book.\"</mark>\n                            </li>\n                            <li>\n                                - <b>So'roq gaplar:</b> Bu gaplar savol beradi. Ular savol belgisi bilan tugaydi. Misol: <mark>\"Are you coming to the party?\"</mark>\n                            </li>\n                            <li>\n                                - <b>Imperativ gaplar:</b> Bu gaplar buyruq yoki ko'rsatmalar beradi. Ular nuqta yoki undov belgisi bilan tugashi mumkin. Misol:  <mark>\"Please pass me the salt.\"</mark>\n                            </li>\n                            <li>\n                                - <b>Undov gaplar:</b> Bu jumlalar kuchli his-tuyg'ularni yoki hayajonni ifodalaydi. Ular undov belgisi bilan tugaydi. Misol: <mark>\"What a beautiful sunset!\"</mark>\n                            </li>\n                            <li>\n                                - <b>Shartli gaplar:</b> Bu gaplar shart va uning ehtimoliy natijasini ifodalaydi. Ular ko'pincha \"agar\" yoki \"agar\" kabi so'zlarni o'z ichiga oladi. Misol: <mark>\"If it rains, we will stay indoors.\"</mark>\n                            </li>\n                            <li>\n                                - <b>Nisbiy so'zlar:</b> Bu gaplar ot haqida qo'shimcha ma'lumot beradi. Ular “kim”, “qaysi” yoki “bu” kabi nisbiy olmosh bilan boshlanadi. Misol: <mark>\"The book that I borrowed from the library is fascinating.\"</mark>\n                            </li>\n                        </ol>\n                    </i>\n                "
            },
            {
                "id": 2,
                "name": "Oddiy gap",
                "content": "\n                    <b>Oddiy gap:</b>\n                    <i>\n                        <p>Mustaqil gap sifatida ham tanilgan oddiy gap, bitta predmet va bitta predikatdan tashkil topgan gap tuzilishining bir turi. U to‘liq fikr yoki fikrni ifodalaydi va grammatik jihatdan to‘g‘ri gap sifatida alohida turishi mumkin.</p>\n                        <p>Oddiy gapning asosiy belgilariga quyidagilar kiradi:</p>\n                        <ul>\n                            <li>U faqat bitta mustaqil banddan iborat.</li>\n                            <li>Odatda u harakatni bajaradigan sub'ekt (ot yoki olmosh) va harakat yoki holatni (fe'l yoki fe'l ibora) tavsiflovchi predikatga ega.</li>\n                            <li>Unda hech qanday tobe yoki tobe bogʻlovchilar mavjud emas.</li>\n                            <li>U har xil turdagi bayonotlar, savollar, buyruqlar yoki undovlarni ifodalashi mumkin.</li>\n                        </ul>\n                        <p>Oddiy gaplarga misollar:</p>\n                        <ul>\n                            <li><mark>\"She sings.\"</mark> (subject: \"She\" / predicate: \"sings\")</li>\n                            <li><mark>\"The cat is sleeping.\"</mark> (subject: \"The cat\" / predicate: \"is sleeping\")</li>\n                            <li><mark>\"He ran to catch the bus.\"</mark> (subject: \"He\" / predicate: \"ran to catch the bus\")</li>\n                            <li><mark>\"Did you finish your homework?\"</mark> (subject: \"You\" / predicate: \"did finish your homework\")</li>\n                            <li><mark>\"Please be quiet!\"</mark> (subject: implied \"You\" / predicate: \"be quiet\")</li>\n                            <li><mark>\"What a beautiful flower!\"</mark> (subject: implied \"It\" / predicate: \"is a beautiful flower\")</li>\n                        </ul>\n                        <p>Oddiy gaplar murakkabroq gap tuzilmalarining qurilish bloklari hisoblanadi. Ular boshqa turdagi gaplar yoki bo‘laklar bilan qo‘shilib, qo‘shma gaplar, murakkab gaplar yoki qo‘shma murakkab gaplar yaratish mumkin.</p>\n                    </i>\n                "
            },
            {
                "id": 3,
                "name": "Qo'shma gap",
                "content": "\n                    <b>Bog‘lovchilar:</b>\n                    <i>\n                        <p>Ingliz tili grammatikasida bogʻlovchi gap ichidagi soʻzlarni, iboralarni yoki gaplarni bogʻlaydigan nutq qismidir. Bog‘lovchilar gapning umumiy tuzilishida mantiqiy munosabatlar va izchillik yaratish uchun turli elementlarni muvofiqlashtirish yoki birlashtirish uchun xizmat qiladi.</p>\n                        <p>Bog‘lovchilar haqida asosiy fikrlar quyidagilardan iborat:</p>\n                        <ul>\n                            <li><b>Qo‘shma gap turlari:</b> Bog‘lovchilarning har xil turlari mavjud:</li>\n                            <ul>\n                                <li><i>Muvofiqlashtiruvchi qo‘shma gaplar:</i> Bu bog‘lovchilar bir xil grammatik ahamiyatga ega bo‘lgan so‘z, ibora yoki mustaqil gaplarni bog‘laydi. Masalan, “and”, “but”, “or”, “nor” va “yet”.</li>\n                                <li><i>Tobe bog‘lovchilar:</i> Bu bog‘lovchilar o‘z ma’nosiga ko‘ra bosh gapga bog‘liq bo‘lgan ergash gaplarni kiritadi. Misollar: \"because\", \"although\", \"while\", \"if\" va \"since\".</li>\n                                <li><i>Korrelyatsion qo‘shma gaplar:</i> Bu bog‘lovchilar juft bo‘lib ishlaydi va gapdagi muvozanatli elementlarni bog‘laydi. Masalan, “either... or”, “neither... nor”, “both... and”, “not only... but”.</li>\n                                <li><i>Bog‘lovchi ergash gaplar:</i> Bu ergash gaplar bog‘lovchi vazifasini bajaradi, mustaqil gaplarni bog‘laydi. Masalan, “but”, “therefore”, “at the same time” va “so” kabilar.</li>\n                            </ul>\n                            <li><b>Funktsiya:</b> Bog'lovchilar gap ichidagi so'zlar, iboralar yoki gaplar o'rtasidagi munosabatlarni ko'rsatishga yordam beradi. Ular qoʻshimcha, qarama-qarshilik, sabab va natija, shart, maqsad, vaqt va boshqalarni koʻrsatishi mumkin.</li>\n                            <li><b>Foydalanish:</b> Bog‘lovchilar qo‘shma gaplar, murakkab gaplar yoki qo‘shma gaplar yasash uchun ishlatiladi. Ular, shuningdek, jumlalar bo'laklari va ketma-ket gaplardan qochishga yordam beradi.</li>\n                            <li><b>Joylashuv:</b> Bog‘lovchilar qo‘shma gapning turiga va bog‘langan elementlarga qarab turli o‘rinlarda paydo bo‘lishi mumkin.</li>\n                        </ul>\n                        <p>Qoʻshma gaplarga misollar:</p>\n                        <ul>\n                            <li><mark>\"I like tea <b>and</b> coffee.\"</mark> (coordinating conjunction)</li>\n                            <li><mark>\"She studied hard <b>so</b> she could pass the exam.\"</mark> (subordinating conjunction)</li>\n                            <li><mark>\"He not only plays the guitar, <b>but also</b> sings.\"</mark> (correlative conjunction)</li>\n                            <li><mark>\"The weather was nice; <b>thus</b>, we went for a walk.\"</mark> (conjunctive adverb)</li>\n                        </ul>\n                        <p>Bog‘lovchilar gapning turli qismlarini bog‘lashda, ularning umumiy ravshanligi va izchilligini oshirishda hal qiluvchi rol o‘ynaydi.</p>\n                    </i>\n                "
            },
            {
                "id": 4,
                "name": "Qo'shma murakkab gap",
                "content": "\n                    <b>Murakkab gap:</b>\n                    <i>\n                        <p>Murakkab gap - bu bitta mustaqil va kamida bitta tobe bo'lakdan iborat bo'lgan gap tuzilishi. U asosiy fikrni (mustaqil gap) va qo‘shimcha ma’lumot yoki bo‘ysunuvchi fikrlarni (bog‘liq gap) ifodalash orqali bir gapda bir nechta fikrlarni birlashtiradi.</p>\n                        <p>Murakkab gapning asosiy belgilari quyidagilardan iborat:</p>\n                        <ul>\n                            <li>U toʻliq gap sifatida alohida turishi mumkin boʻlgan bitta mustaqil gapni oʻz ichiga oladi.</li>\n                            <li>U yolg'iz turolmaydigan va ma'no jihatidan mustaqil bandga tayanadigan kamida bitta tobe gapni o'z ichiga oladi.</li>\n                            <li>Tobe bog‘lovchi yoki nisbiy olmosh yordamida kiritiladi.</li>\n                            <li>Bogʻlangan band qoʻshimcha maʼlumot beradi, tafsilotlarni qoʻshadi yoki mustaqil bandga munosabatni ifodalaydi.</li>\n                        </ul>\n                        <p>Murakkab gaplarga misollar:</p>\n                        <ul>\n                            <li><mark>\"Although it was raining, I went for a walk.\"</mark> (independent clause: \"I went for a walk\" / dependent clause: \"Although it was raining\")</li>\n                            <li><mark>\"She returned the book that she borrowed from the library.\"</mark> (independent clause: \"She returned the book\" / dependent clause: \"that she borrowed from the library\")</li>\n                            <li><mark>\"I will call you when I arrive at the airport.\"</mark> (independent clause: \"I will call you\" / dependent clause: \"when I arrive at the airport\")</li>\n                            <li><mark>\"Because he studied hard, he passed the exam.\"</mark> (independent clause: \"he passed the exam\" / dependent clause: \"Because he studied hard\")</li>\n                        </ul>\n                        <p>Murakkab gaplar sabab va oqibat, shart, vaqt, kontrast va boshqalar kabi turli munosabatlarni ifodalashga imkon beradi. Ular yozma va og‘zaki ingliz tilini chuqur va murakkablashtiradi.</p>\n                    </i>\n                "
            }
        ]
    },
    {
        "id": 3,
        "name": "Nutq",
        "submenu": [
            {
                "id": 1,
                "name": "Nutq qismlari",
                "content": "\n                    <b>Nutq qismlari:</b>\n                    <i>\n                        <p>Ingliz tili grammatikasida so'zlar nutq qismlari deb ataladigan turli toifalarga bo'linadi. Gapning har bir qismi gap ichida oʻziga xos rol va vazifaga ega boʻlib, tilning umumiy tuzilishi va maʼnosiga hissa qoʻshadi.</p>\n                        <p>Mana, ingliz tilidagi nutqning asosiy qismlari:</p>\n                        <ul>\n                            <li><b>Ot:</b> Ot - shaxs, joy, narsa yoki fikrni ifodalovchi so'z. Masalan, “dog”, “city”, “book” va “love”.</li>\n                            <li><b>Olmosh:</b> Olmosh - ot yoki ibora oʻrnini bosuvchi soʻz. Masalan, “he”, “she”, “it” va “they”</li>\n                            <li><b>Fe'l:</b> Fe'l - harakat, hodisa yoki holatni ifodalovchi so'z. Masalan, “run”, “eat”, “sleep” va “is.”</li>\n                            <li><b>Sifat:</b> Sifat ot yoki olmoshni tavsiflovchi yoki oʻzgartiruvchi soʻzdir. Masalan, “beautiful”, “happy”, “tall” va “interesting”.</li>\n                            <li><b>Zarmot:</b> Qo'shimcha - fe'l, sifat yoki boshqa qo'shimchani tavsiflovchi yoki o'zgartiruvchi so'z. Misollar: \"quickly\", \"very\", \"carefully\" va \"often\".</li>\n                            <li><b>Bosh gap:</b> Bosh gap - ot yoki olmosh va gapdagi boshqa elementlar oʻrtasidagi munosabatni koʻrsatuvchi soʻz. Masalan, “in”, “on”, “at” va “under”</li>\n                            <li><b>Bogʻlovchi:</b> Bogʻlovchi soʻz, ibora yoki gaplarni bogʻlovchi soʻzdir. Masalan, “and”, “but”, “or” va “because.”</li>\n                            <li><b>Interjection:</b> Kesim kuchli his-tuyg'u yoki hayratni ifodalovchi so'z yoki iboradir. Masalan, “wow”, “oh”, “woo” va “bravo”.</li>\n                        </ul>\n                        <p>Nutqning turli qismlarini tushunish grammatik jihatdan toʻgʻri va mazmunli jumlalar tuzishga yordam beradi. Gapning har bir qismi gapning umumiy tuzilishi va vazifasiga hissa qo‘shadi.</p>\n                    </i>\n                "
            }
        ]
    },
    {
        "id": 4,
        "name": "Olmosh",
        "submenu": [
            {
                "id": 1,
                "name": "Turlari va ta'rifi",
                "content": "\n                    <b>Olmosh va uning turlari:</b>\n                    <i>\n                        <p>Olmosh - ot yoki ibora oʻrnida qoʻllanuvchi soʻz. Bu takrorlashni oldini olishga yordam beradi va jumlalarga aniqlik kiritadi. Olmoshlar odamlarga, narsalarga, hayvonlarga, joylarga va boshqalarga ishora qilishi mumkin.</p>\n                        <p>Ingliz tilidagi olmoshlarning asosiy turlari:</p>\n                        <ul>\n                            <li><b>Shaxs olmoshlari:</b> Shaxs olmoshlari aniq shaxs yoki narsalarni bildiradi. Ular grammatik shaxs (birinchi shaxs, ikkinchi shaxs, uchinchi shaxs) va son (birlik yoki koʻplik)ga qarab farqlanadi. Masalan,  \"I,\" \"you,\" \"he,\" \"she,\" \"it,\" \"we,\" va \"they.</li>\n                            <li><b>Refleksiv olmoshlar:</b> Refleks olmoshlar gapning predmeti va predmeti bir xil shaxs yoki narsaga nisbatan qo‘llaniladi. Ular shaxs olmoshlariga  \"-self\" (birlik) yoki \"-selves\" (ko‘plik) qo‘shilishi bilan yasaladi. Misollar: \"myself,\" \"yourself,\" \"himself,\" \"herself,\" \"itself,\" \"ourselves,\" va \"themselves.\" <li>\n                            <li><b>Ega olmoshlari:</b> Egalik olmoshlari egalik yoki egalikni bildiradi. Ular apostrofni talab qilmaydi. Masalan, \"mine,\" \"yours,\" \"his,\" \"hers,\" \"its,\" \"ours,\" and \"theirs.\"</li>\n                            <li><b>Nisbiy olmoshlar:</b> Nisbiy olmoshlar bosh gapdagi ot yoki olmosh haqida qoʻshimcha maʼlumot beruvchi nisbiy qoʻshimchalar kiritadi. Masalan, \"who,\" \"whom,\" \"whose,\" \"which,\" and \"that.\"</li>\n                            <li><b>Ko'rsatish olmoshlari:</b> Ko'rgazma olmoshlari aniq shaxs yoki narsalarni ko'rsatadi. Masalan, \"this,\" \"that,\" \"these,\" and \"those.\"</li>\n                            <li><b>So‘roq olmoshlari:</b> So‘roq olmoshlari savol berish uchun ishlatiladi. Ular so‘roq gaplarni kiritadilar. Masalan, \"who,\" \"whom,\" \"whose,\" \"which,\" and \"what.\"</li>\n                            <li><b>Noaniq olmoshlar:</b> Noaniq olmoshlar oʻziga xos boʻlmagan shaxs yoki narsalarni bildiradi. Misollar: \"someone,\" \"anyone,\" \"everyone,\" \"something,\" \"anything,\" \"nothing,\" \"all,\" \"both,\" \"few,\" \"many,\" \"none,\" and \"several.\"</li>\n                            <li><b>O‘zaro olmoshlar:</b> O‘zaro olmoshlar ikki yoki undan ortiq kishi yoki narsalar o‘rtasidagi o‘zaro harakat yoki munosabatni bildiradi. Asosiy oʻzaro olmosh \"each other.\".</li>\n                        </ul>\n                        <p>Har xil turdagi olmoshlarni tushunish turli kontekstlarda tegishli olmoshlardan foydalanishga yordam beradi, gaplarni ixcham va tushunarli qiladi.</p>\n                    </i>\n                "
            },
            {
                "id": 2,
                "name": "Shaxs olmoshlari",
                "content": "\n                    <b>Shaxs olmoshlari:</b>\n                    <i>\n                        <p>Shaxs olmoshlari aniq shaxs yoki narsalarni bildiruvchi olmoshlarning bir turi. Ular grammatik shaxs (birinchi shaxs, ikkinchi shaxs, uchinchi shaxs) va son (birlik yoki koʻplik)ga qarab farqlanadi. Kishilik olmoshlari gapda tobe, predmet yoki ega aniqlovchi vazifasini bajaradi.</p>\n                        <p>Kishilik olmoshlarining turli shakllari:</p>\n                        <ul>\n                            <li><b>Birinchi shaxs:</b> Birinchi shaxs olmoshlari so‘zlovchi(lar)ni yoki so‘zlovchi(lar)ni boshqalar bilan birga bildiradi. Ularga quyidagilar kiradi:</li>\n                            <ul>\n                                <li><b>Birlik:</b> I, me, my, mine</li>\n                                <li><b>Ko‘plik:</b> we, us, our, ours</li>\n                            </ul>\n                            <li><b>Ikkinchi shaxs:</b> Ikkinchi shaxs olmoshlari murojaat qilinayotgan shaxs(lar)ni bildiradi. Ularga quyidagilar kiradi:</li>\n                            <ul>\n                                <li><b>Birlik:</b> you, your, yours</li>\n                                <li><b>Koʻplik:</b> you, your, yours</li>\n                            </ul>\n                            <li><b>Uchinchi shaxs:</b> Uchinchi shaxs olmoshlari kimnidir yoki biror narsa haqida gapirilayotganini bildiradi. Ularga quyidagilar kiradi:</li>\n                            <ul>\n                                <li><b>Birlik:</b> he, him, his (masculine), she, her, hers (feminine), it, its (neuter)</li>\n                                <li><b>Ko‘plik:</b> they, them, their, theirs</li>\n                            </ul>\n                        </ul>\n                        <p>Mana, jumlalarda ishlatiladigan shaxs olmoshlariga misollar:</p>\n                        <ul>\n                            <li><b>Mavzu olmoshlari:</b> <i>I</i> went to the store. <i>He</i> is my friend</li>\n                            <li><b>Ob'ekt olmoshlari:</b> She gave <i>me</i> a present. We saw them at the park</li>\n                            <li><b>Ega aniqlovchilar:</b> This is <i>my</i> book. Is this <i>your</i> car?</li>\n                        </ul>\n                        <p>Shaxs olmoshlari o'zimizga, boshqalarga va narsalarga murojaat qilishimizga imkon berib, muloqotda hal qiluvchi rol o'ynaydi. Ular takrorlashni oldini olishga va jumlalarga aniqlik kiritishga yordam beradi.</p>\n                    </i>\n                "
            },
            {
                "id": 3,
                "name": "Refleksiv olmoshlar",
                "content": "\n                    <b>Refleksiv olmoshlar:</b>\n                    <i>\n                        <p>Refleksiv olmoshlar gapning predmeti va ob'ekti bir xil shaxs yoki narsaga ishora qilganda qo'llaniladigan olmoshning bir turi. Ular ma’lum shaxs olmoshlariga “-self” (birlik) yoki “-selves” (ko‘plik) qo‘shilishi bilan yasaladi.</p>\n                        <p>Mana, ingliz tilidagi refleksiv olmoshlar:</p>\n                        <ul>\n                            <li><b>Birlik:</b> myself, yourself, himself, herself, itself</li>\n                            <li><b>Koʻplik:</b>  ourselves, yourselves, themselves</li>\n                        </ul>\n                        <p>Refleksiv olmoshlar fe'lning harakatini mavzuga qaytaradigan gaplarda qo'llaniladi. Ular sub'ektning harakatni o'zi yoki o'zi bajarishini ta'kidlaydi.</p>\n                        <p>Mana, gaplarda ishlatiladigan refleksiv olmoshlarga misollar:</p>\n                        <ul>\n                            <li>I will <b>myself</b> complete the task.</li>\n                            <li>She cut <b>herself</b> while cooking.</li>\n                            <li>He taught <b>himself</b> how to play the guitar.</li>\n                            <li>The cat is cleaning <b>itself</b>.</li>\n                            <li>We should be proud of <b>ourselves</b>.</li>\n                            <li>They prepared <b>themselves</b> for the exam.</li>\n                        </ul>\n                        <p>Refleksiv olmoshlar oʻz-oʻzidan harakatni koʻrsatish yoki subʼyektning oʻzi yoki oʻzi ustida harakat qilishini taʼkidlashda muhim ahamiyatga ega.</p>\n                    </i>\n                "
            },
            {
                "id": 4,
                "name": "Ega olmoshlari",
                "content": "\n                    <b>Ega olmoshlari:</b>\n                    <i>\n                        <p>Ega olmoshlari egalik yoki egalikni bildiruvchi olmoshlarning bir turi. Ular biror narsa kimgadir yoki biror narsaga tegishli ekanligini bildiradi.</p>\n                        <p>Mana, ingliz tilidagi egalik olmoshlari:</p>\n                        <ul>\n                            <li><b>Birlik:</b> mine, yours, his, hers, its</li>\n                            <li><b>Ko‘plik:</b> ours, yours, theirs</li>\n                        </ul>\n                        <p>Ega olmoshlari egalik aniqlovchilarining oʻrnini bosish uchun ishlatiladi (“mening”, “sizning”, “uning” va hokazo.) va gapda ot vazifasini bajaradi.</p>\n                        <p>Mana, gaplarda ishlatiladigan egalik olmoshlariga misollar:</p>\n                        <ul>\n                            <li>The blue car is <b>mine</b>.</li>\n                            <li>Is this pen <b>yours</b> or <b>his</b>?</li>\n                            <li>The book is <b>hers</b>, not <b>mine</b>.</li>\n                            <li>The cat licked <b>its</b> paws.</li>\n                            <li>This house is <b>ours</b>.</li>\n                            <li>Are those bags <b>theirs</b>?</li>\n                        </ul>\n                        <p>Egalik olmoshlari qoʻshimcha otlarsiz egalik yoki egalikni bildirishga yordam beradi. Ular jumlalarni soddalashtiradi va ixcham qiladi.</p>\n                    </i>\n                "
            },
            {
                "id": 5,
                "name": "Nisbiy olmoshlar",
                "content": "\n                    <b>Nisbiy olmoshlar:</b>\n                    <i>\n                        <p>Nisbiy olmoshlar nisbiy gaplarni kirituvchi olmoshlarning bir turi. Ular tobe gapni bosh gapga bog‘lash va bosh gapdagi ot yoki olmosh haqida qo‘shimcha ma’lumot berish uchun ishlatiladi.</p>\n                        <p>Mana, ingliz tilidagi nisbiy olmoshlar:</p>\n                        <ul>\n                            <li><b>Kim:</b> Odamlarga ishora qiladi. Nisbatan gapdagi sub'ektlar yoki ob'ektlar uchun ishlatiladi. Misol: The man <b>who</b> is standing over there is my brother.</li>\n                            <li><b>Kim:</b> Odamlarga ishora qiladi. Nisbatan gapda ob'ekt sifatida ishlatiladi. Misol: The woman to <b>whom</b> I gave the book is my teacher.</li>\n                            <li><b>Qaysi:</b> Narsalar yoki hayvonlarga ishora qiladi. Nisbatan gapdagi sub'ektlar yoki ob'ektlar uchun ishlatiladi. Misol: The car <b>which</b> is parked outside is mine.</li>\n                            <li><b>Bu:</b> Odamlar, narsalar yoki hayvonlarga ishora qiladi. Nisbatan gapdagi sub'ektlar yoki ob'ektlar uchun ishlatiladi. Misol: The dog <b>that</b> I adopted is very friendly.</li>\n                            <li><b>Kimning:</b> Egaligini ko'rsatadi. Biror narsaga tegishli bo'lgan shaxs yoki narsani ko'rsatish uchun ishlatiladi. Misol: The girl <b>whose</b> bag was stolen reported it to the police.</li>\n                            <li><b>Qaysi biri:</b> Cheklangan miqdordagi narsa yoki imkoniyatlardan biriga murojaat qilish uchun ishlatiladi. Misol: You can choose <b>whichever</b> movie you want to watch.</li>\n                        </ul>\n                        <p>Nisbiy olmoshlar gaplarni birlashtirishga yordam beradi va ular nazarda tutilgan ot yoki olmosh haqida muhim ma'lumotlarni beradi. Ular murakkab gaplar tuzishda hal qiluvchi rol o‘ynaydi.</p>\n                        <p>Bu yerda nisbiy olmosh qo‘llangan misol jumla:</p>\n                        <p>The book <b>that</b> I am reading is very interesting.</p>\n                    </i>\n                "
            },
            {
                "id": 6,
                "name": "Ko'rsatish olmoshlari",
                "content": "\n                    <b>Ko'rsatish olmoshlari:</b>\n                    <i>\n                        <p>Ko'rsatish olmoshlari aniq shaxs, narsa yoki joyni Ko'rsatish yoki aniqlovchi olmosh turidir. Ular so‘zlovchi va tinglovchiga nisbatan nisbiy masofani bildiradi.</p>\n                        <p>Mana, ingliz tilidagi ko'rsatuvchi olmoshlari:</p>\n                        <ul>\n                            <li><b>Bu:</b> Ma'ruzachiga yaqin bo'lgan shaxs, narsa yoki fikrga ishora qiladi. Misol: <b>This</b> is my bookm.</li>\n                            <li><b>Bu:</b> Ma'ruzachidan uzoqroqda bo'lgan shaxs, narsa yoki fikrni bildiradi. Misol: I want to buy <b>that</b> car.</li>\n                            <li><b>Bular:</b> Ma'ruzachiga yaqin bo'lgan bir nechta shaxs, narsalar yoki fikrlarga ishora qiladi. Misol: Can you pass me <b>these</b> papers?</li>\n                            <li><b>Ular:</b> Ma'ruzachidan uzoqroq bo'lgan bir nechta shaxs, narsa yoki g'oyalarga ishora qiladi. Misol: I don't like <b>those</b> shoes.</li>\n                        </ul>\n                        <p>Ko'rsatish olmoshlari suhbat yoki matndagi muayyan narsalarni yoki odamlarni ko‘rsatish yoki ko‘rsatish uchun ishlatiladi. Ular aniqlik va aniqlikni ta'minlashga yordam beradi.</p>\n                        <p>Mana, jumlalarda ishlatiladigan koʻrsatuvchi olmoshlariga misollar:</p>\n                        <ul>\n                            <li><b>This</b> is my favorite movie.</li>\n                            <li>I want to visit <b>that</b> museum.</li>\n                            <li><b>These</b> are my new shoes.</li>\n                            <li>I saw him talking to <b>those</b> people.</li>\n                        </ul>\n                        <p>Ko'rsatish olmoshlari berilgan kontekstdagi predmetlar, odamlar yoki fikrlarni ko‘rsatish va farqlashda muhim rol o‘ynaydi.</p>\n                    </i>\n                "
            },
            {
                "id": 7,
                "name": "So'roq olmoshlari",
                "content": "\n                    <b>So‘roq olmoshlari:</b>\n                    <i>\n                        <p>So‘roq olmoshlari savol so‘rash uchun ishlatiladigan olmoshlarning bir turi. Ular noma'lum ma'lumotlar haqida so'rash yoki aniqlik kiritish uchun ishlatiladi.</p>\n                        <p>Mana, ingliz tilidagi so'roq olmoshlari:</p>\n                        <ul>\n                            <li><b>Kim:</b> Odamlar haqida so'rash uchun ishlatiladi. Misol: <b>Who</b> is coming to the party?</li>\n                            <li><b>Kim:</b> Fe'l yoki bosh gapning ob'ekti haqida so'rash uchun ishlatiladi. Misol: <b>Whom</b> did you see at the concert?</li>\n                            <li><b>Kimning:</b> Egalik yoki egalik haqida so'rash uchun ishlatiladi. Misol: <b>Whose</b> car is parked outside?</li>\n                            <li><b>Nima:</b> Narsalar yoki harakatlar haqida so'rash uchun ishlatiladi. Misol: <b>What</b> is your favorite color?</li>\n                            <li><b>Qaysi:</b> Tanlov yoki tanlov haqida so'rash uchun ishlatiladi. Misol: <b>Which</b> book do you recommend?</li>\n                        </ul>\n                        <p>Soʻroq olmoshlari tinglovchi yoki oʻquvchidan aniq maʼlumotlarni yigʻish uchun savol boshida qoʻllaniladi.</p>\n                        <p>Mana, gaplarda ishlatiladigan soʻroq olmoshlariga misollar:</p>\n                        <ul>\n                            <li><b>Who</b> is the new teacher?</li>\n                            <li><b>Whom</b> did you invite to the party?</li>\n                            <li><b>Whose</b> laptop is this?</li>\n                            <li><b>What</b> time is the meeting?</li>\n                            <li><b>Which</b> color do you prefer, red or blue?</li>\n                        </ul>\n                        <p>So'roq olmoshlari suhbat va yozma muloqotda savollarni shakllantirish va aniq ma'lumotlarni to'plashda hal qiluvchi rol o'ynaydi.</p>\n                    </i>\n                "
            },
            {
                "id": 8,
                "name": "Noaniq olmoshlar",
                "content": "\n                    <b>Noaniq olmoshlar:</b>\n                    <i>\n                        <p>Noaniq olmoshlar - oʻziga xos boʻlmagan yoki nomaʼlum kishilar, narsalar yoki joylarga ishora qiluvchi olmoshlarning bir turi. Ular aniq identifikator yoki raqamni ko'rsatishimiz kerak bo'lmaganda ishlatiladi.</p>\n                        <p>Mana, ingliz tilidagi bir nechta umumiy noaniq olmoshlar:</p>\n                        <ul>\n                            <li><b>Kimdir:</b> Noma'lum shaxsga ishora qiladi. Misol: <b>Somebody</b> left their umbrella in the hallway.</li>\n                            <li><b>Biror narsa:</b> Noma'lum narsa yoki ob'ektga ishora qiladi. Misol: I saw <b>something</b> strange in the garden.</li>\n                            <li><b>Har kim:</b> Muayyan shaxsni ko'rsatmasdan har qanday shaxsga ishora qiladi. Misol: Is <b>anyone</b> available to help me?</li>\n                            <li><b>Har qanday narsa:</b> Muayyan narsani ko'rsatmasdan har qanday narsa yoki ob'ektga ishora qiladi. Misol: You can choose <b>anything</b> from the menu.</li>\n                            <li><b>Har kim:</b> Har bir shaxsga ishora qiladi. Misol: <b>Everyone</b> is excited about the upcoming event.</li>\n                            <li><b>Hammasi:</b> Har bir narsa yoki ob'ektga ishora qiladi. Misol: <b>Everything</b> is going according to plan.</li>\n                            <li><b>Hech kim:</b> Hech kimni yoki bitta odamni nazarda tutmaydi. Misol: <b>No one</b> knows the answer to that question.</li>\n                            <li><b>Hech narsa:</b> Hech narsaning yo'qligi yoki biror narsaning etishmasligini bildiradi. Misol: There's <b>nothing</b> left in the fridge.</li>\n                        </ul>\n                        <p>Noaniq olmoshlar gapda aniqlanmagan yoki oʻziga xos boʻlmagan shaxsga murojaat qilmoqchi boʻlganimizda ishlatiladi.</p>\n                        <p>Mana, jumlalarda ishlatiladigan noaniq olmoshlarga misollar:</p>\n                        <ul>\n                            <li><b>Somebody</b> called while you were out.</li>\n                            <li>I need <b>something</b> to drink.</li>\n                            <li>Does <b>anyone</b> know the answer?</li>\n                            <li>I don't want to eat <b>anything</b> spicy.</li>\n                            <li><b>Everyone</b> enjoyed the concert.</li>\n                            <li>I've searched everywhere, but I can't find <b>anything</b>.</li>\n                            <li><b>No one</b> can solve this puzzle.</li>\n                            <li>There's <b>nothing</b> better than a good book.</li>\n                        </ul>\n                        <p>Noaniq olmoshlar umumlashma, oʻziga xos boʻlmagan shaxslarga ishora qilish va gapda oʻziga xoslik yoʻqligini ifodalashda muhim rol oʻynaydi.</p>\n                    </i>\n                "
            },
            {
                "id": 9,
                "name": "O‘zaro olmoshlar",
                "content": "\n                    <b>O'zaro olmoshlar:</b>\n                    <i>\n                        <p>Oʻzaro olmoshlar, shuningdek, oʻzaro olmoshlar, ikki yoki undan ortiq kishi yoki narsalar oʻrtasidagi oʻzaro yoki oʻzaro munosabatni bildirish uchun ishlatiladigan olmosh turidir. Ular harakat yoki tuyg'u o'zaro yoki birgalikda ekanligini ko'rsatadi.</p>\n                        <p>Mana, ingliz tilidagi oʻzaro olmoshlar:</p>\n                        <ul>\n                            <li><b>Bir-biriga:</b> Harakat yoki tuyg'u ikki kishi o'rtasida o'zaro bo'lganda ishlatiladi. Misol: John and Lisa love <b>each other</b>.</li>\n                            <li><b>Bir-biridan:</b> Harakat yoki tuyg'u ikkidan ortiq kishi o'rtasida o'zaro bo'lsa ishlatiladi. Misol: The team members support <b>one another</b>.</li>\n                        </ul>\n                        <p>O‘zaro olmoshlar tasvirlanayotgan munosabat yoki harakatning o‘zaro xususiyatini ta’kidlash uchun ishlatiladi.</p>\n                        <p>Mana, jumlalarda ishlatiladigan oʻzaro olmoshlarga misollar:</p>\n                        <ul>\n                            <li>They always help <b>each other</b> with their homework.</li>\n                            <li>The siblings often give gifts to <b>one another</b> on their birthdays.</li>\n                            <li>The neighbors greeted <b>each other</b> warmly.</li>\n                            <li>The students worked together and learned from <b>one another</b>.</li>\n                        </ul>\n                        <p>O‘zaro olmoshlar gapda o‘zaro munosabat yoki umumiy harakatlar va his-tuyg‘ularni ifodalash uchun zarurdir.</p>\n                    </i>\n                "
            }
        ]
    },
    {
        "id": 5,
        "name": "Fe'l",
        "submenu": [
            {
                "id": 1,
                "name": "Turlari va ta'rifi",
                "content": "\n                    <b>Fe'llar:</b>\n                    <i>\n                        <p>Fe'l - gapdagi harakat, hodisa yoki holatni ifodalovchi so'z. Bu jumla tuzilishining muhim qismi boʻlib, mavzu nima qilayotgani yoki boshdan kechirayotgani haqida maʼlumot beradi.</p>\n                        <p>Bu erda fe'llarning asosiy xususiyatlari va turlari keltirilgan:</p>\n                        <ul>\n                            <li><b>Harakat fe'llari:</b> Harakat fe'llari sub'ekt tomonidan bajariladigan jismoniy yoki aqliy harakatlarni tasvirlaydi. Misollar: <b>run</b>, <b>eat</b>, <b>think</b>.</li>\n                            <li><b>Bog‘lovchi fe'llar:</b> Bog‘lovchi fe'llar gapning predmetini uni tavsiflovchi yoki nomini o‘zgartiruvchi ot, olmosh yoki sifatdoshga bog‘laydi. Misollar: <b>be</b>, <b>seem</b>, <b>become</b>.</li>\n                            <li><b>Yordamchi fe'llar:</b> Yordamchi fe'llar, shuningdek, yordamchi fe'llar sifatida ham tanilgan, asosiy fe'lga fe'l zamonlari, ovozlari va kayfiyatlarini yaratishda yordam beradi. Misollar: <b>do</b>, <b>have</b>, <b>can</b>.</li>\n                            <li><b>Modal fe'llar:</b> Modal fe'llar munosabat, imkoniyatlar, ruxsat yoki majburiyatlarni ifodalaydi. Misollar: <b>can</b>, <b>may</b>, <b>must</b>.</li>\n                            <li><b>O'timli fe'llar:</b> O'tish fe'llari o'z ma'nosini to'ldirish uchun to'g'ridan-to'g'ri ob'ektni talab qiladi. Misollar: She <b>ate</b> an apple. They <b>built</b> a house.</li>\n                            <li><b>O'timsiz fe'llar:</b> O'timsiz fe'llar to'g'ridan-to'g'ri ob'ektni talab qilmaydi va gapda yolg'iz turishi mumkin. Misollar: He <b>ran</b> quickly. The bird <b>sang</b>.</li>\n                            <li><b>Oddiy fe'llar:</b> Muntazam fe'llar asos shakliga \"-ed\" qo'shish orqali o'tgan zamon va o'tgan zamon sifatdoshini hosil qiladi. Misollar: <b>walked</b>, <b>talked</b>, <b>played</b>.</li>\n                            <li><b>Irregular fe'llar:</b> Noto'g'ri fe'llar muntazam qolipga amal qilmaydi va ularning o'tgan zamon va o'tgan zamon shakllari uchun o'ziga xos shakllarga ega. Misollar: <b>go</b> (went, gone), <b>eat</b> (ate, eaten), <b>see</b> (saw, seen).</li>\n                        </ul>\n                        <p>Fe'llar jumla tuzishda muhim rol o'ynaydi va harakatlar, holatlar va munosabatlarni etkazishda yordam beradi. Ular gapning umumiy ma'nosi va dinamikasiga hissa qo'shadi.</p>\n                        <p>Gaplarda ishlatiladigan fe'llarga misollar:</p>\n                        <ul>\n                            <li>She <b>runs</b> every morning to stay fit.</li>\n                            <li>The flowers <b>smell</b> delightful.</li>\n                            <li>We <b>have</b> been waiting for hours.</li>\n                            <li>You <b>must</b> complete the assignment by tomorrow.</li>\n                            <li>He <b>built</b> a sandcastle on the beach.</li>\n                            <li>The sun <b>sets</b> in the west.</li>\n                            <li>I <b>walked</b> to the store and <b>bought</b> some groceries.</li>\n                            <li>They <b>went</b> on a trip to Europe.</li>\n                        </ul>\n                        <p>Fe'llar va ularning har xil turlarini tushunish mazmunli va grammatik jihatdan to'g'ri gaplar tuzish uchun zarurdir.</p>\n                    </i>\n                "
            },
            {
                "id": 2,
                "name": "Harakat fe'llari",
                "content": "\n                    <b>Harakat fe'llari:</b>\n                    <i>\n                        <p>Harakat fe'llari, nomidan ko'rinib turibdiki, jumla sub'ekti tomonidan amalga oshiriladigan jismoniy yoki aqliy harakatlarni maxsus tavsiflovchi fe'llardir. Ular mavzu nima qilayotganini yoki boshdan kechirayotganini bildiradi.</p>\n                        <p>Mana, harakat fe'llariga misollar:</p>\n                        <ul>\n                            <li><b>Yugurish</b>: He <b>runs</b> every morning to stay fit.</li>\n                            <li><b>Ovqat</b>: She <b>eats</b> an apple for breakfast.</li>\n                            <li><b>Yozing</b>: The student <b>writes</b> an essay for the assignment.</li>\n                            <li><b>sakrash</b>: The athlete <b>jumps</b> over the hurdle.</li>\n                            <li><b>O'ylab ko'ring</b>: I <b>think</b> about the problem and find a solution.</li>\n                            <li><b>O'yin</b>: The children <b>play</b> in the park.</li>\n                        </ul>\n                        <p>Harakat fe'llari jumladagi dinamik harakatlar, harakatlar va fikrlarni tasvirlash uchun zarurdir. Ular jumlaga energiya va hayotiylik qo'shadi.</p>\n                        <p>E'tiborga olish kerakki, harakat fe'llari mavzuga mos kelishi va gapda kerakli ma'noni bildirishi uchun turli zamon va shakllarda qo'shilishi mumkin.</p>\n                    </i>\n                "
            },
            {
                "id": 3,
                "name": "Bog'lovchi fe'llar",
                "content": "\n                    <b>Bog‘lovchi fe’llar:</b>\n                    <i>\n                        <p>Bog‘lovchi fe’llar, shuningdek, ko‘p fe’llar deb ham ataladi, gap mavzusini ot, olmosh yoki sifatdoshga bog‘lovchi fe’l turi bo‘lib, uni tavsiflovchi yoki nomini o‘zgartiradi. Ular harakatni ko'rsatmaydi, balki munosabatlar yoki mavjudlik holatini o'rnatadi.</p>\n                        <p>Bu erda fe'llarni bog'lashning ba'zi misollari keltirilgan:</p>\n                        <ul>\n                            <li><b>Bo'lmoq</b>: She <b>is</b> a doctor.</li>\n                            <li><b>Ko'rinadi</b>: The movie <b>seems</b> interesting.</li>\n                            <li><b>Bo'ling</b>: He <b>became</b> a successful businessman.</li>\n                            <li><b>Ko'rinish</b>: The sun <b>appears</b> bright in the sky.</li>\n                            <li><b>His eting</b>: They <b>feel</b> tired after a long day.</li>\n                            <li><b>Ovoz</b>: The music <b>sounds</b> melodious.</li>\n                        </ul>\n                        <p>Bog'lovchi fe'llar harakatni ifodalamaydi, balki mavzuni u haqida qo'shimcha ma'lumot bilan bog'laydi. Ular mavzuni tasvirlashga yordam beradi yoki uning holati yoki xususiyatlari haqida batafsil ma’lumot beradi.</p>\n                        <p>Shuni e'tiborga olish kerakki, bog‘lovchi fe'llardan keyin to‘ldiruvchi kelishi mumkin, ular predmetni tavsiflovchi yoki nomini o‘zgartiruvchi ot, olmosh yoki sifatdosh bo‘lishi mumkin.</p>\n                    </i>\n                "
            },
            {
                "id": 4,
                "name": "Yordamchi fe'llar",
                "content": "\n                    <b>Yordamchi fe'llar:</b>\n                    <i>\n                        <p>Yordamchi fe'llar, shuningdek, yordamchi fe'llar sifatida ham tanilgan, gapdagi asosiy fe'l bilan birgalikda zamon, kayfiyat, ovoz yoki urg'uni ifodalovchi fe'llardir. Ular turli xil fe'l so'z birikmalarini yaratishga yordam beradi va gapga qo'shimcha ma'no qo'shadi.</p>\n                        <p>Yordamchi fe'llarga misollar keltiramiz:</p>\n                        <ul>\n                            <li><b>Be</b>: She <b>is</b> studying for her exams.</li>\n                            <li><b>Have</b>: They <b>have</b> finished their homework.</li>\n                            <li><b>Do</b>: He <b>did</b> his best in the competition.</li>\n                            <li><b>Can</b>: She <b>can</b> speak multiple languages.</li>\n                            <li><b>Will</b>: We <b>will</b> go on vacation next week.</li>\n                            <li><b>Should</b>: You <b>should</b> apologize for your mistake.</li>\n                        </ul>\n                        <p>Yordamchi fe'llar gapda asosiy fe'l vazifasini bajarmaydi, balki asosiy fe'lga yordam beradi. Ular turli xil fe’l zamonlarini etkazish, savollar va inkorlarni shakllantirish, qobiliyat yoki ruxsatni ifodalash va boshqalarga yordam beradi.</p>\n                        <p>E'tiborga olish kerakki, yordamchi fe'llar ko'pincha asosiy fe'l bilan qo'shilib fe'l iboralarni hosil qiladi.</p>\n                    </i>\n                "
            },
            {
                "id": 5,
                "name": "Modal fe'llar",
                "content": "\n                    <b>Modal fe'llar:</b>\n                    <i>\n                        <p>Modal koʻmakchilar deb ham ataladigan modal feʼllar asosiy feʼl bilan ifodalangan harakat yoki holatga soʻzlovchining munosabati, zarurati, imkoniyati yoki qobiliyatini bildiruvchi koʻmakchi feʼlning bir turidir. Modal fe’llar gapga ma’no tus va tus beradi.</p>\n                        <p>Modal fe'llarga bir nechta misollar:</p>\n                        <ul>\n                            <li><b>Can</b>: I <b>can</b> swim.</li>\n                            <li><b>Could</b>: They <b>could</b> help you with the project.</li>\n                            <li><b>May</b>: She <b>may</b> arrive late.</li>\n                            <li><b>Might</b>: He <b>might</b> come to the party.</li>\n                            <li><b>Must</b>: You <b>must</b> complete the assignment.</li>\n                            <li><b>Should</b>: We <b>should</b> exercise regularly.</li>\n                            <li><b>Would</b>: He <b>would</b> like to join us.</li>\n                        </ul>\n                        <p>Modal fe'llar asosiy fe'lning ma'nosini o'zgartirib, zarurat, imkoniyat, qobiliyat, ruxsat, maslahat va boshqalarni bildiradi. Ular koʻpincha gapda aniqlik yoki majburiyat darajasini ifodalaydi.</p>\n                        <p>Shuni e'tiborga olish kerakki, modal fe'llardan keyin asosiy fe'lning asosiy shakli keladi va qo'shimcha yordamchi fe'l kerak emas.</p>\n                    </i>\n                "
            }
        ]
    },
    {
        "id": 6,
        "name": "Bog'lovchi",
        "submenu": [
            {
                "id": 1,
                "name": "Turlari va ta'rifi",
                "content": "\n                    <b>Bog‘lovchilar:</b>\n                    <i>\n                        <p>Ingliz tili grammatikasida qoʻshma gaplar jumla ichidagi soʻzlar, iboralar yoki gaplarni bogʻlaydigan soʻz yoki iboralardir. Ular gapning turli qismlarini qo‘shish va ular orasidagi munosabatni ko‘rsatish uchun ishlatiladi.</p>\n                        <p>Bog‘lovchilar vazifasiga ko‘ra turli turlarga bo‘linadi:</p>\n                        <ul>\n                            <li><b>Muvofiqlashtiruvchi qo‘shma gaplar</b>: Muvofiqlashtiruvchi qo‘shma so‘zlar, iboralar yoki bir xil ahamiyatga ega bo‘lgan mustaqil gaplarni bog‘laydi. Ba'zi bir umumiy muvofiqlashtiruvchi bog'lanishlarga quyidagilar kiradi: <b>and, but, or, nor, for, yet, so</b>. . Masalan, \"I like apples <b>and</b> oranges.\"</li>\n                            <li><b>Tobe bog‘lovchilar</b>: Tobe bog‘lovchilar o‘z mazmuniga ko‘ra bosh gapga bog‘liq bo‘lgan ergash gaplarni kiritadi. Ular qaramlik yoki bo'ysunish munosabatlarini o'rnatadilar. Baʼzi bir umumiy tobe bogʻlovchilarga quyidagilar kiradi: <b>because, although, while, if, when, since, until</b>. Masalan, \"She went to the store <b>because</b> she needed groceries.\"</li>\n                            <li><b>Korrelyatsion qo‘shma gaplar</b>: O‘zaro bog‘lovchilar juft bo‘lib, gapning o‘xshash qismlarini bog‘laydi. Ular elementlar orasidagi munosabatlarni ko'rsatish uchun ishlatiladi. Baʼzi umumiy korrelyativ bogʻlovchilarga quyidagilar kiradi:  <b>either...or, neither...nor, both...and, not only...but also</b>. Masalan, \"You can <b>either</b> stay at home <b>or</b> go to the party.\"</li>\n                            <li><b>Bog‘lovchi ergash gaplar</b>: Bog‘lovchi qo‘shma gap sifatida mustaqil gaplarni bog‘lash yoki fikr o‘rtasidagi munosabatni ko‘rsatish uchun ishlatiladi. Baʼzi umumiy qoʻshma ergash gaplarga quyidagilar kiradi:<b>lekin, shuning uchun, bundan tashqari, bundan tashqari, shunga qaramay</b>. Masalan, \"I wanted to go to the park <b>however</b>, it started raining.\"</li>\n                        </ul>\n                        <p>Bog‘lovchilar fikrlarni bog‘lash, qarama-qarshilikni ko‘rsatish, qo‘shimcha ma’lumot berish yoki sabab va natijani ko‘rsatish orqali gap tuzilishi va izchilligida hal qiluvchi rol o‘ynaydi.</p>\n                        <p>Shuni e'tiborga olish kerakki, bog'lovchilar qo'llanishi va ma'nosiga ko'ra farq qilishi mumkin, shuning uchun ularning turli kontekstlarda o'ziga xos funktsiyalarini tushunish juda muhimdir.</p>\n                    </i>\n                "
            },
            {
                "id": 2,
                "name": "Tobe bog'lovchilar",
                "content": "\n                    <b>Tobe bog‘lovchilar:</b>\n                    <i>\n                        <p>Ingliz tili grammatikasida tobe bog‘lovchilar ergash gaplarni kirituvchi bog‘lovchilar turi hisoblanadi. Bu bog‘lovchilar bosh gap bilan ergash gap o‘rtasida tobelik yoki tobelik munosabatini o‘rnatadi.</p>\n                        <p>Bu yerda bir nechta umumiy tobe bog‘lovchilar keltirilgan:</p>\n                        <ul>\n                            <li><b>Because</b>: He stayed home <b>because</b> he was feeling sick.</li>\n                            <li><b>Although</b>: <b>Although</b> it was raining, they went for a walk.</li>\n                            <li><b>While</b>: She read a book <b>while</b> waiting for the bus.</li>\n                            <li><b>If</b>: I will go to the party <b>if</b> I finish my homework.</li>\n                            <li><b>When</b>: We'll have dinner <b>when</b> Dad gets home.</li>\n                            <li><b>Since</b>: They have been friends <b>since</b> childhood.</li>\n                            <li><b>Until</b>: Please wait here <b>until</b> I return.</li>\n                        </ul>\n                        <p>To‘g‘ridan-to‘g‘ri ergash gaplar to‘liq gap sifatida mustaqil turolmaydigan ergash gaplarni kiritadi. Ular bosh gap bilan ergash gap o‘rtasidagi vaqt, sabab va natija, shart, yondoshuv, qarama-qarshilik va boshqalar munosabatini bildiradi.</p>\n                        <p>Shuni e'tiborga olish kerakki, ergash gap ergash gap bilan boshlansa, u o'z ma'nosi bo'yicha bosh gapga tobe bo'lib qoladi va mustaqil ishlay olmaydi.</p>\n                    </i>            \n                "
            },
            {
                "id": 3,
                "name": "Korrelyativ bog'lovchilar",
                "content": "\n                    <b>Korrelyatsion bog'lovchilar:</b>\n                    <i>\n                        <p>Ingliz tili grammatikasida korrelyatsion bog'lovchilar jumlaning o‘xshash qismlarini bog‘lash uchun birgalikda ishlaydigan juft bog‘lovchilardir. Ular munosabatlarni ko'rsatish va ikki yoki undan ortiq elementlar orasidagi parallellikni ta'kidlash uchun ishlatiladi.</p>\n                        <ul>\n                            <li><b>Either...or</b>: You can <b>either</b> stay at home <b>or</b> go to the party.</li>\n                            <li><b>Neither...nor</b>: <b>Neither</b> the sun <b>nor</b> the moon was visible.</li>\n                            <li><b>Both...and</b>: He <b>both</b> sings <b>and</b> plays the guitar.</li>\n                            <li><b>Not only...but also</b>: She is <b>not only</b> intelligent, <b>but also</b> hardworking.</li>\n                            <li><b>Whether...or</b>: I don't know <b>whether</b> he will come <b>or</b> not.</li>\n                            <li><b>As...as</b>: She is <b>as</b> tall <b>as</b> her sister.</li>\n                        </ul>\n                        <p>Korrelativ bog‘lovchilar gapda bir xil ahamiyatga ega bo‘lgan so‘z, ibora yoki gaplarni birlashtirish uchun ishlatiladi. Ular muvozanat hosil qiladi va bog'langan elementlar o'rtasidagi munosabatni ta'kidlaydi.</p>\n                        <p>Korrelyatsion bog'lovchilar har doim juft holda qo‘llanilishini va gap tuzilishi parallellikni saqlab turishini ta’kidlash muhim.</p>\n                    </i>\n                "
            }
        ]
    },
    {
        "id": 7,
        "name": "Zamonlar",
        "submenu": [
            {
                "id": 1,
                "name": "Zamonlar haqida",
                "content": "\n                    <b>Ingliz tilidagi zamonlar:</b>\n                    <i>\n                        <p>Ingliz tili grammatikasida harakat yoki hodisaning vaqtini bildirish uchun zamonlar ishlatiladi. Ingliz tilida bir nechta zamonlar mavjud bo'lib, ularning har biri ma'lum bir maqsadga xizmat qiladi. Quyida bir nechta umumiy zamonlar va ularning formulalari keltirilgan:</p>\n                        \n                        <b>Simple Present Tense:</b>\n                        <p class = \"text-primary\">Formula: Subject + Verb</p>\n                        <p>Example: <mark>He plays</mark> the guitar.</p>\n                        \n                        <b>Present Continuous Tense:</b>\n                        <p class = \"text-primary\">Formula: Subject + am/is/are + Verb + -ing</p>\n                        <p>Example: <mark>They are studying</mark> for the exam.</p>\n                        \n                        <b>Simple Past Tense:</b>\n                        <p class = \"text-primary\">Formula: Subject + Verb (past tense)</p>\n                        <p>Example: <mark>She walked</mark> to the park.</p>\n                        \n                        <b>Past Continuous Tense:</b>\n                        <p class = \"text-primary\">Formula: Subject + was/were + Verb + -ing</p>\n                        <p>Example: <mark>He was playing</mark> football.</p>\n                        \n                        <b>Present Perfect Tense:</b>\n                        <p class = \"text-primary\">Formula: Subject + have/has + Past Participle</p>\n                        <p>Example: <mark>They have finished</mark> their homework.</p>\n                        \n                        <b>Past Perfect Tense:</b>\n                        <p class = \"text-primary\">Formula: Subject + had + Past Participle</p>\n                        <p>Example: <mark>She had already eaten</mark> when I arrived.</p>\n                        \n                        <b>Future Simple Tense:</b>\n                        <p class = \"text-primary\">Formula: Subject + will + Verb</p>\n                        <p>Example: <mark>We will go</mark> to the beach tomorrow.</p>\n                        \n                        <b>Future Continuous Tense:</b>\n                        <p class = \"text-primary\">Formula: Subject + will be + Verb + -ing</p>\n                        <p>Example: <mark>They will be waiting</mark> for you at the airport.</p>\n                        \n                        <b>Future Perfect Tense:</b>\n                        <p class = \"text-primary\">Formula: Subject + will have + Past Participle</p>\n                        <p>Example: <mark>By next week, he will have completed</mark> the project.</p>\n                        \n                        <p>Bular ingliz tilidagi zamonlarning bir nechta misollari. Har bir zamon harakat yoki hodisaning vaqti va davomiyligini ko‘rsatadigan o‘ziga xos formulaga ega.</p>\n                    </i>\n                "
            },
            {
                "id": 2,
                "name": "O'tgan zamon(qisqacha)",
                "content": "\n                    <b>O‘tgan oddiy zamon:</b>\n                    <i>\n                        <p>Ingliz tili grammatikasida o'tgan sodda zamon o'tmishda sodir bo'lgan bajarilgan harakatlar yoki hodisalarni tasvirlash uchun ishlatiladi. U ko'pincha o'tmishda ma'lum vaqt yoki davrda sodir bo'lgan muayyan harakatlar yoki holatlar haqida gapirish uchun ishlatiladi.</p>\n                        <p>O‘tgan sodda zamonni yasash formulasi:</p>\n                        <p class = \"text-primary\">Subject + Verb (past tense)</p>\n                        <p>Masalan:</p>\n                        <p><mark>She walked</mark> to the park.</p>\n                        <p><mark>They played</mark> football yesterday.</p>\n                        <p><mark>I studied</mark> French in high school.</p>\n                        <p>O'tgan sodda zamon odatda fe'lning asosiy shakliga \"-ed\" qo'shish orqali o'tgan zamonni hosil qiluvchi oddiy fe'llardan foydalanadi. Shu bilan birga, ingliz tilida tartibsiz fe’llar ham ko‘p bo‘lib, ular o‘tgan zamonning o‘ziga xos shakllariga ega bo‘lib, ular muntazam naqshga amal qilmaydi.</p>\n                        <p>Shuni e'tiborga olish kerakki, o'tgan sodda zamon tugallangan va hozirgi bilan hech qanday aloqasi bo'lmagan harakatlar yoki hodisalar uchun ishlatiladi. O'tmishda davom etayotgan yoki odatiy harakatlar uchun o'tgan davomli zamon yoki boshqa tegishli zamon ishlatilishi mumkin.</p>\n                    </i>\n                "
            },
            {
                "id": 3,
                "name": "Hozirgi zamon(qisqacha)",
                "content": "\n                    <b>Hozirgi zamon:</b>\n                    <i>\n                        <p>Ingliz tili grammatikasida hozirgi zamon hozir sodir bo'layotgan harakatlar yoki holatlar, odatiy harakatlar, umumiy haqiqatlar yoki kelajakda sodir bo'lishi rejalashtirilgan harakatlarni tasvirlash uchun ishlatiladi.</p>\n                        <p>Hozirgi zamonni yasash formulasi aniq fe'l va mavzuga bog'liq:</p>\n                        <p>- Uchinchi shaxs birlik sub'ektlari (he, she, it) uchun formula: <span class = \"text-primary\">Subject + Fe'l + -s/es</span></p>\n                        <p>- Boshqa barcha mavzular uchun (I, you, we, they) formula: <span class = \"text-primary\">Subject + Fe'l</span></p>\n                        <p>Masalan:</p>\n                        <p><mark>She plays</mark> the piano.</p>\n                        <p><mark>They study</mark> English.</p>\n                        <p><mark>We are going</mark> to the party tonight.</p>\n                        <p>Hozirgi zamon hozirgi vaqtda sodir bo'layotgan harakatlar, umumiy haqiqatlar, odatiy harakatlar yoki rejalashtirilgan yoki rejalashtirilgan kelajakdagi harakatlar haqida gapirish uchun ishlatiladi. Bundan tashqari, bevositalik tuyg'usini yaratish uchun muayyan hikoya kontekstlarida ham foydalanish mumkin.</p>\n                        <p>E'tiborga olish kerakki, hozirgi zamonning turli xil shakllari mavjud, masalan, hozirgi zamon, hozirgi zamon davomi, hozirgi mukammal va boshqalar, ular hozirgi vaqtning turli tomonlarini bildirish uchun ishlatiladi.</p>\n                    </i>\n                "
            },
            {
                "id": 4,
                "name": "Kelasi zamon(qisqacha)",
                "content": "\n                    <b>Kelasi zamon:</b>\n                    <i>\n                        <p>Ingliz tili grammatikasida kelasi zamon hozirgi paytdan keyin sodir bo'ladigan harakatlar yoki hodisalarni tasvirlash uchun ishlatiladi. U kelajakdagi rejalar, niyatlar, bashoratlar yoki rejalashtirilgan voqealar haqida gapirish uchun ishlatiladi.</p>\n                        <p>Kelajak zamonni yasash formulasi kelasi zamonning o‘ziga xos shakliga bog‘liq:</p>\n                        <p>- Oddiy kelasi zamon uchun formula quyidagicha: <span class = \"text-primary\">Subject + will + Verb</span></p>\n                        <p>- Kelgusi davomli zamon uchun formula quyidagicha: <span class = \"text-primary\">Subject + will be + Verb (ending in -ing)</span></p>\n                        <p>- Kelajakdagi mukammal zamon uchun formula quyidagicha: <span class = \"text-primary\">Subject + will have + fe'lning o'tgan zamon sifatdoshi</span></p>\n                        <p>Masalan:</p>\n                        <p><mark>I will travel</mark> to Paris next month.</p>\n                        <p><mark>They will be studying</mark> for their exams tomorrow.</p>\n                        <p><mark>She will have finished</mark> the project by the end of the week.</p>\n                        <p>Kelajak zamon hozirgi paytdan keyin kelajakda sodir bo'ladigan harakatlar yoki hodisalarni muhokama qilish uchun ishlatiladi. U ma'ruzachilarga kelajakdagi harakatlar yoki holatlarga oid rejalar, bashoratlar yoki niyatlarni ifodalash imkonini beradi.</p>\n                        <p>Shuni e'tiborga olish kerakki, kelasi zamonning boshqa shakllari, masalan, kelajak mukammal uzluksiz va kelajakdagi mukammal progressiv, kelajakdagi harakatlar yoki hodisalarning turli tomonlarini bildirish uchun ham ishlatilishi mumkin.</p>\n                    </i>\n                "
            }
        ]
    },
    {
        "id": 8,
        "name": "O'tgan zamon",
        "submenu": [
            {
                "id": 1,
                "name": "Simple Past Tense",
                "content": "\n                    <b>Oddiy o‘tgan zamon:</b>\n                    <i>\n                        <p>Ingliz tili grammatikasida Simple Past Tense o'tmishda sodir bo'lgan bajarilgan harakatlar yoki voqealarni tasvirlash uchun ishlatiladi. Bu amal tugaganligini va endi davom etmasligini bildiradi.</p>\n                        <p>Oddiy o‘tgan zamonni yasash formulasi:</p>\n                        <p class = \"text-primary\" >Subject + Verb (o'tgan zamon)</p>\n                        <p>Doimiy fe'llar uchun o'tgan zamon fe'lning asos shakliga \"-ed\" qo'shilishi bilan yasaladi. Biroq, o'tgan zamonning o'ziga xos shakllariga ega bo'lgan tartibsiz fe'llar ko'p.</p>\n                        <p>Doimiy fe'llarga misollar:</p>\n                        <p>- Base form: <mark>play</mark> → Past tense: <mark>played</mark></p>\n                        <p>- Base form: <mark>work</mark> → Past tense: <mark>worked</mark></p>\n                        <p>Noto'g'ri fe'llarga misollar:</p>\n                        <p>- Base form: <mark>go</mark> → Past tense: <mark>went</mark></p>\n                        <p>- Base form: <mark>eat</mark> → Past tense: <mark>ate</mark></p>\n                        <p>Oddiy oʻtgan zamon koʻpincha oʻtmishdagi maʼlum vaqtni bildiruvchi vaqt iboralari bilan ishlatiladi, masalan, kecha, oʻtgan hafta yoki men bolaligim.</p>\n                        <p>Misol jumlalar:</p>\n                        <p>- <mark>We went</mark> to the beach last summer.</p>\n                        <p>- <mark>She studied</mark> French in college.</p>\n                        <p>- <mark>I visited</mark> my grandparents yesterday.</p>\n                        <p>E'tiborga olish kerakki, Simple Past Tense o'tmishda to'liq tugagan va hozirgi bilan hech qanday aloqasi bo'lmagan harakatlar yoki hodisalar uchun ishlatiladi.</p>\n                    </i>\n                "
            },
            {
                "id": 2,
                "name": "Past Continuous Tense",
                "content": "\n                    <b>O'tgan davomli zamon:</b>\n                    <i>\n                        <p>Ingliz tili grammatikasida Past Continuous Tense o'tmishda ma'lum bir vaqtda yoki vaqt oralig'ida sodir bo'lgan davom etayotgan yoki davomli harakatlarni tasvirlash uchun ishlatiladi. U oʻtmishdagi harakatning davomiyligi yoki borishini taʼkidlaydi.</p>\n                        <p>O‘tgan davomli zamonni yasash formulasi:</p>\n                        <p class=\"text-primary\">Subject + was/were + Fe'l (hozirgi zamon shakli) + -ing</p>\n                        <p>Yordamchi fe'li \"was\" birlik predmetlar bilan ishlatiladi (e.g., I, he, she, it), \"were\" esa ko'plik sub'ektlari bilan ishlatiladi (e.g., we, you, they).</p>\n                        <p>O‘tgan davomli zamonga misollar:</p>\n                        <p>- <mark>I was studying</mark> all night for the exam.</p>\n                        <p>- <mark>She was cooking</mark> dinner when the guests arrived.</p>\n                        <p>- <mark>They were playing</mark> soccer at the park yesterday.</p>\n                        <p>O‘tmishdagi davomli zamon ko‘pincha Simple Past Tense bilan birga ishlaydi yoki ko‘proq kontekst beradi yoki o‘tmishdagi uzilgan harakatni tasvirlaydi. Simple Past Tense uzluksiz harakat bajarilayotganda sodir bo‘lgan boshqa harakatni ko‘rsatish uchun ishlatiladi.</p>\n                        <p>O‘tgan davomli va oddiy o‘tmish birikmasidan iborat gapga misol:</p>\n                        <p>- <mark>She was reading</mark> a book when the phone rang.</p>\n                        <p>Past Continuous Tense oʻtmishdagi uzluksiz fon harakatini ifodalash, sodir boʻlgan boshqa harakat yoki hodisa uchun sahnani belgilash uchun ham ishlatilishi mumkin.</p>\n                        <p>Uzluksiz fon harakati bilan misol gap:</p>\n                        <p>- <mark>The sun was shining</mark> as we walked along the beach.</p>\n                        <p>E'tibor bering, Past Continuous Tense o'tmishda bajarilgan, lekin tugallanmagan yoki bajarilmagan harakatlar uchun ishlatiladi.</p>\n                    </i>\n                "
            },
            {
                "id": 3,
                "name": "Past Perfect Tense",
                "content": "\n                    <b>O'tgan tugallangan zamon:</b>\n                    <i>\n                        <p>Ingliz tili grammatikasida Past Perfect Tense boshqa o'tmishdagi harakat yoki hodisadan oldin tugallangan harakatni ifodalash uchun ishlatiladi. U oʻtmishdagi oʻtmishni koʻrsatadi va oʻtmishda sodir boʻlgan harakatni koʻrsatadi.</p>\n                        <p>Past Perfect Tense yasalish formulasi:</p>\n                        <p class=\"text-primary\">Subject + had + fe'lning o'tgan zamon sifatdoshi</p>\n                        <p>\"Had\" yordamchi fe'li shaxs yoki raqamdan qat'i nazar, barcha mavzularda qo'llaniladi.</p>\n                        <p>O'tgan mukammal zamonga misollar:</p>\n                        <p>- <mark>I had finished</mark> my work before the meeting started.</p>\n                        <p>- <mark>They had already eaten</mark> dinner when I arrived.</p>\n                        <p>- <mark>She had traveled</mark> to several countries before settling down.</p>\n                        <p>Past Perfect Tense ko'pincha o'tmishdagi voqealar ketma-ketligini ifodalash uchun ishlatiladi, bu erda bir harakat yoki hodisa boshqasidan oldin sodir bo'lgan.</p>\n                        <p>Hodisalar ketma-ketligi bilan misol gap:</p>\n                        <p>- <mark>He had studied</mark> French for many years before he moved to Paris.</p>\n                        <p>Past Perfect Tense o'tmishdagi amalga oshirilmagan imkoniyat yoki taxminiy vaziyat haqida gapirish uchun ham ishlatilishi mumkin.</p>\n                        <p>Amalga olinmagan ehtimolli gapga misol:</p>\n                        <p>- <mark>If I had known</mark> about the party, I would have attended.</p>\n                        <p>Shuni e'tiborga olish kerakki, Past Perfect Tense har doim boshqa o'tgan zamon bilan, masalan Simple Past Tense yoki Past Continuous Tense bilan birgalikda qo'llaniladi va voqealarning aniq vaqt jadvalini taqdim etadi.</p>\n                    </i>\n                "
            },
            {
                "id": 4,
                "name": "Past Perfect Continuous Tense",
                "content": "\n                    <b>Past Perfect Continuous Tense:</b>\n                    <i>\n                        <p>Ingliz tili grammatikasida Past Perfect Continuous Tense o'tmishda boshlangan, ma'lum bir davr mobaynida davom etgan va boshqa o'tgan harakat yoki hodisadan oldin tugallangan davomiy harakatni ifodalash uchun ishlatiladi. U oʻtmishdagi maʼlum bir nuqtadan oldin sodir boʻlgan harakatning davomiyligini taʼkidlaydi.</p>\n                        <p>Past Perfect Continuous Tenseni yasash formulasi:</p>\n                        <p class=\"text-primary\">Subject + had been + fe'lning hozirgi zamon kesimi (-ing shakli)</p>\n                        <p>\"Had been\" yordamchi fe'li shaxs yoki raqamdan qat'i nazar, barcha mavzularda qo'llaniladi.</p>\n                        <p>Past Perfect Continuous Tense misollari:</p>\n                        <p>- <mark>I had been working</mark> for six hours before I took a break.</p>\n                        <p>- <mark>They had been studying</mark> English for two years before they moved to an English-speaking country.</p>\n                        <p>- <mark>She had been waiting</mark> at the airport for over an hour when her flight was finally announced.</p>\n                        <p>Past Perfect Continuous Tense ko'pincha o'tmishdagi ma'lum bir nuqtadan oldin yoki boshqa o'tgan harakatdan oldin sodir bo'lgan harakatning davomiyligini ko'rsatish uchun ishlatiladi.</p>\n                        <p>Davomiylikni bildiruvchi gapga misol:</p>\n                        <p>- <mark>He had been practicing</mark> the piano for three hours before he gave the concert.</p>\n                        <p>Past Perfect Continuous Tense ikki oʻtmishdagi harakat yoki hodisa oʻrtasidagi sabab-natija munosabatini ifodalash uchun ham ishlatilishi mumkin.</p>\n                        <p>Sabab va oqibatni ko'rsatadigan misol gap:</p>\n                        <p>- <mark>She was out of breath</mark> because she had been running.</p>\n                        <p>Shuni e'tiborga olish kerakki, Past Perfect Continuous Tense har doim boshqa o'tgan zamon bilan birgalikda ishlatiladi, masalan Simple Past Tense yoki Past Perfect Tense, voqealarning aniq vaqt jadvalini taqdim etish uchun.</p>\n                    </i>\n                "
            }
        ]
    },
    {
        "id": 9,
        "name": "Hozirgi zamon",
        "submenu": [
            {
                "id": 1,
                "name": "Simple Present Tense",
                "content": "\n                    <b>Oddiy hozirgi zamon:</b>\n                    <i>\n                        <p>Ingliz tili grammatikasida Simple Present Tense hozirgi vaqtda sodir bo'ladigan harakatlar, faktlar, odatlar va umumiy haqiqatlarni tasvirlash uchun ishlatiladi. U tartiblar, muntazam harakatlar va umuman toʻgʻri yoki doimiy boʻlgan narsalar haqida gapirish uchun ishlatiladi.</p>\n                        <p>Oddiy hozirgi zamonni yasash formulasi:</p>\n                        <p class=\"text-primary\">Mavzu + fe'lning asosiy shakli</p>\n                        <p>Fe'l barcha sub'ektlar uchun asos shaklida (infinitiv) qoladi, uchinchi shaxs birlikdan tashqari, fe'lga \"s\" qo'shiladi.</p>\n                        <p>Oddiy hozirgi zamonga misollar:</p>\n                        <p>- <mark>I work</mark> at a company in the city.</p>\n                        <p>- <mark>She plays</mark> the guitar in a band.</p>\n                        <p>- <mark>We study</mark> English every day.</p>\n                        <p>Oddiy hozirgi zamon ko'pincha hozir sodir bo'layotgan harakatlar yoki holatlarni, shuningdek, umumiy haqiqatlarni yoki odatiy harakatlarni ifodalash uchun ishlatiladi.</p>\n                        <p>Hozirgi harakatlarga misollar:</p>\n                        <p>- <mark>He drinks</mark> a cup of coffee every morning.</p>\n                        <p>- <mark>They play</mark> basketball on weekends.</p>\n                        <p>Umumiy haqiqatlarga misollar:</p>\n                        <p>- <mark>Water boils</mark> at 100 degrees Celsius.</p>\n                        <p>- <mark>The Earth revolves</mark> around the Sun.</p>\n                        <p>Simple Present Tense rejalashtirilgan yoki rejalashtirilgan kelajakdagi voqealar, masalan, jadvallar yoki qat'iy jadvallar haqida gapirish uchun ham ishlatilishi mumkinligini ta'kidlash muhimdir.</p>\n                        <p>Rejalashtirilgan voqea uchun misol gap:</p>\n                        <p>- <mark>The train leaves</mark> at 9 o'clock tomorrow morning.</p>\n                    </i>\n                "
            },
            {
                "id": 2,
                "name": "Present Continuous Tense",
                "content": "\n                    <b>Hozirgi davomli zamon:</b>\n                    <i>\n                        <p>Ingliz tili grammatikasida Present Continuous Tense nutq paytida sodir bo'layotgan harakatlar yoki bajarilayotgan harakatlarni tasvirlash uchun ishlatiladi. U hozirda davom etayotgan yoki vaqtinchalik vaziyatni bildiradi.</p>\n                        <p>Present Continuous Tense yasalish formulasi:</p>\n                        <p class=\"text-primary\">Subject + am/is/are + hozirgi zamon kesimi (fe'lning -ing shakli)</p>\n                        <p>Hozirgi zamon fe'lning asos shakliga \"-ing\" qo'shilishi bilan yasaladi.</p>\n                        <p>Hozirgi davomli zamonga misollar:</p>\n                        <p>- <mark>I am working</mark> on a project right now.</p>\n                        <p>- <mark>They are studying</mark> for their exams this week.</p>\n                        <p>- <mark>She is playing</mark> tennis at the moment.</p>\n                        <p>Present Continuous Tense ko'pincha hozirgi vaqtda sodir bo'layotgan vaqtinchalik harakatlar yoki vaziyatlar haqida gapirish uchun ishlatiladi. Bundan kelajakdagi tadbirlar yoki rejalar haqida gapirish uchun ham foydalanish mumkin.</p>\n                        <p>Hozir amalga oshirilayotgan harakatlarga misollar:</p>\n                        <p>- <mark>He is talking</mark> on the phone.</p>\n                        <p>- <mark>They are watching</mark> a movie.</p>\n                        <p>Kelajakdagi kelishuvlarga misollar:</p>\n                        <p>- <mark>I am meeting</mark> my friend tomorrow.</p>\n                        <p>- <mark>We are traveling</mark> to Paris next month.</p>\n                        <p>Shuni e'tiborga olish kerakki, hozirgi doimiy zamon vaqtinchalik vaziyatlar va davom etayotgan harakatlar uchun, Simple Present Tense esa umumiy haqiqatlar va odatiy harakatlar uchun ishlatiladi.</p>\n                    </i>\n                "
            },
            {
                "id": 3,
                "name": "Present Perfect Tense",
                "content": "\n                    <b>Present Perfect Tense:</b>\n                    <i>\n                        <p>Ingliz tili grammatikasida Present Perfect Tense o'tmishda boshlangan va hozirgi bilan bog'liq bo'lgan harakatlar yoki holatlarni tasvirlash uchun ishlatiladi. U tugallangan harakat yoki hozirda tegishli tajribani bildiradi.</p>\n                        <p>Present Perfect Tense yasalish formulasi:</p>\n                        <p class=\"text-primary\">Subject + has/have + o'tgan zamon fe'li</p>\n                        <p>O'tgan zamon fe'lning uchinchi shakli bo'lib, ko'pincha oddiy fe'llar uchun \"-ed\" bilan tugaydi. Biroq tartibsiz fe’llarning o‘ziga xos o‘tgan zamon shakllari mavjud.</p>\n                        <p>Present Perfect Tense misollari:</p>\n                        <p>- <mark>I have finished</mark> my homework.</p>\n                        <p>- <mark>She has traveled</mark> to many countries.</p>\n                        <p>- <mark>They have seen</mark> that movie before.</p>\n                        <p>Present Perfect Tense ko'pincha hozirgi bilan bog'liq bo'lgan o'tmishdagi harakatlar yoki tajribalar haqida gapirish uchun ishlatiladi. Odatda ifodalash uchun ishlatiladi:</p>\n                        <ul>\n                            <li>O'tmishda noma'lum vaqtda sodir bo'lgan harakatlar yoki hodisalar.</li>\n                            <li>O'tmishda boshlangan va hozirgacha davom etadigan harakatlar yoki hodisalar.</li>\n                            <li>Hozirda sodir boʻlgan yoki yaqinda tugallangan harakatlar yoki hodisalar.</li>\n                        </ul>\n                        <p>Misollar:</p>\n                        <p>- <mark>We have lived</mark>. (davom etayotgan harakat)</p>\n                        <p>- <mark>I have visited</mark>. (tugallangan harakat)</p>\n                        <p>- <mark>He has just finished</mark>. (yaqinda bajarilgan harakat)</p>\n                        <p>Shuni e'tiborga olish kerakki, hozirgi mukammal zamonda harakat yoki hodisaning aniq vaqti ko'rsatilmagan. Agar vaqt tilga olingan boʻlsa, uning oʻrniga Simple Past Tense ishlatiladi.</p>\n                    </i>\n                "
            },
            {
                "id": 4,
                "name": "Present Perfect Continuous Tense",
                "content": "\n                    <b>Present Perfect Continuous Tense:</b>\n                    <i>\n                        <p>Ingliz tili grammatikasida Present Perfect Continuous Tense o'tmishda boshlangan, davom etgan va hozirgi zamon bilan bog'liq bo'lgan harakatlar yoki holatlarni tasvirlash uchun ishlatiladi. U harakat yoki hodisaning davomiyligi yoki uzluksizligini ta'kidlaydi.</p>\n                        <p>Present Perfect Continuous Tenseni yasash formulasi:</p>\n                        <p class=\"text-primary\">Subject + has/have + been + present participle</p>\n                        <p>Hozirgi zamon fe'lning asos shakliga \"-ing\" qo'shilishi bilan yasaladi.</p>\n                        <p>Present Perfect Continuous Tensega misollar:</p>\n                        <p>- <mark>I have been working</mark> on this project for hours.</p>\n                        <p>- <mark>She has been studying</mark> English since last year.</p>\n                        <p>- <mark>They have been playing</mark> soccer all afternoon.</p>\n                        <p>Present Perfect Continuous Tense ko'pincha ifodalash uchun ishlatiladi:</p>\n                        <ul>\n                            <li>O'tmishda boshlangan, davom etayotgan va hozirgacha davom etayotgan harakatlar yoki hodisalar.</li>\n                            <li>Yaqinda toʻxtatilgan yoki endigina tugatilgan harakatlar yoki hodisalar.</li>\n                            <li>Bir necha marta takrorlangan yoki sodir bo'lgan harakatlar yoki hodisalar.</li>\n                        </ul>\n                        <p>Misollar:</p>\n                        <p>- <mark>We have been waiting</mark> for the bus since morning. (ongoing action)</p>\n                        <p>- <mark>He has been playing</mark> the guitar for two hours. (recently stopped action)</p>\n                        <p>- <mark>They have been traveling</mark> to different countries every summer. (repeated action)</p>\n                        <p>Present Perfect Continuous Tense harakat yoki hodisaning davomiyligi va davomiyligini ta'kidlaydi. Bu harakat yoki hodisa hali ham dolzarbligini yoki hozirgi kunga taʼsiri borligini koʻrsatadi.</p>\n                    </i>\n                "
            }
        ]
    },
    {
        "id": 10,
        "name": "Kelasi zamon",
        "submenu": [
            {
                "id": 1,
                "name": "Simple Future Tense",
                "content": "\n                    <b>Oddiy kelajak zamon:</b>\n                    <i>\n                        <p>Ingliz tili grammatikasida Simple Future Tense kelajakda sodir bo'ladigan harakatlar yoki hodisalarni tasvirlash uchun ishlatiladi. Bu hali amalga oshmagan, lekin amalga oshirilishi kutilayotgan yoki rejalashtirilgan harakatni bildiradi.</p>\n                        <p>Oddiy kelajak zamonni yasash formulasi:</p>\n                        <p class=\"text-primary\">Subject + will + base form of the verb</p>\n                        <p>Oddiy kelajak zamonga misollar:</p>\n                        <p>- <mark>I will study</mark> for the exam tomorrow.</p>\n                        <p>- <mark>She will visit</mark> her family next week.</p>\n                        <p>- <mark>We will go</mark> on vacation next month.</p>\n                        <p>Oddiy kelajak zamon ko'pincha ifodalash uchun ishlatiladi:</p>\n                        <ul>\n                            <li>Kelajak rejalari yoki niyatlari.</li>\n                            <li>Kelajak haqidagi bashoratlar yoki taxminlar.</li>\n                            <li>Spontan qarorlar yoki takliflar.</li>\n                        </ul>\n                        <p>Misollar:</p>\n                        <p>- <mark>They will meet</mark> us at the restaurant tomorrow. (future plan)</p>\n                        <p>- <mark>It will rain</mark> later in the day. (prediction)</p>\n                        <p>- <mark>I will help</mark> you with your homework. (spontaneous decision/offer)</p>\n                        <p>Oddiy kelajak zamon kelajakdagi harakat yoki hodisani, harakatning davomiyligi yoki tugallanishini ta'kidlamasdan bildiradi. U harakat yoki hodisaning hozirgi vaqtga nisbatan vaqtiga qaratiladi.</p>\n                    </i>\n                "
            },
            {
                "id": 2,
                "name": "Future Continuous Tense",
                "content": "\n                    <b>Kelajak davomli zamon:</b>\n                    <i>\n                        <p>Ingliz tili grammatikasida Future Continuous Tense kelajakda ma'lum bir vaqtda sodir bo'ladigan davom etayotgan yoki uzluksiz harakatlarni tasvirlash uchun ishlatiladi.</p>\n                        <p>Kelajak davomli zamonni yasash formulasi:</p>\n                        <p class=\"text-primary\">Subject + will be + present participle (-ing form) of the verb</p>\n                        <p>Kelajak davomli zamonga misollar:</p>\n                        <p>- <mark>I will be working</mark> on a project tomorrow evening.</p>\n                        <p>- <mark>She will be studying</mark> for her exams next week.</p>\n                        <p>- <mark>We will be traveling</mark> to Paris this time next month.</p>\n                        <p>Future Continuous Tense ko'pincha quyidagilar uchun ishlatiladi:</p>\n                        <ul>\n                            <li>Kelajakda ma'lum bir vaqtda bajariladigan amalni ko'rsating.</li>\n                            <li>Kelajak rejalari yoki tadbirlari haqida gapiring.</li>\n                            <li>Kimdirning kelajakdagi xatti-harakatlari haqida xushmuomalalik bilan so'rang yoki taklif qiling.</li>\n                        </ul>\n                        <p>Misollar:</p>\n                        <p>- <mark>They will be having</mark> a meeting at 10 AM tomorrow. (ongoing action at a specific future time)</p>\n                        <p>- <mark>I will be traveling</mark> to London next month. (future plan)</p>\n                        <p>- <mark>Will you be attending</mark> the conference next week? (polite inquiry)</p>\n                        <p>Future Continuous Tense kelajakda sodir bo'ladigan harakatning davom etayotgan xususiyatini ta'kidlaydi. Bu harakat belgilangan kelajakdagi vaqtda ma'lum bir muddat davomida amalga oshirilishini bildiradi.</p>\n                    </i>\n                "
            },
            {
                "id": 3,
                "name": "Future Perfect Tense",
                "content": "\n                    <b>Future Perfect Tense:</b>\n                    <i>\n                        <p>Ingliz tili grammatikasida Future Perfect Tense kelajakda ma'lum vaqtgacha tugallanadigan yoki tugallanadigan harakatni tasvirlash uchun ishlatiladi.</p>\n                        <p>Future Perfect Tense hosil qilish formulasi:</p>\n                        <p class=\"text-primary\">Subject + will have + past participle of the verb</p>\n                        <p>Future Perfect Tense misollari:</p>\n                        <p>- <mark>By the time you arrive</mark>, I will have finished my work.</p>\n                        <p>- <mark>She will have graduated</mark> by the end of this year.</p>\n                        <p>- <mark>They will have completed</mark> the project before the deadline.</p>\n                        <p>Future Perfect Tense ko'pincha quyidagilar uchun ishlatiladi:</p>\n                        <ul>\n                            <li>Kelajakdagi belgilangan vaqt yoki hodisadan oldin bajariladigan amalni ko'rsating.</li>\n                            <li>Kelajakda boshqa harakat yoki vaqtdan oldin sodir bo'ladigan harakat haqida gapiring.</li>\n                            <li>Kelajakdagi bajarilgan harakatlar haqida taxminlar yoki bashoratlarni ifodalang.</li>\n                        </ul>\n                        <p>Misollar:</p>\n                        <p>- <mark>By the time we arrive</mark>, the movie will have started. (completed before a specified future time)</p>\n                        <p>- <mark>She will have finished</mark> her studies before she starts her new job. (completed before another action)</p>\n                        <p>- <mark>I'm sure he will have called</mark> by tomorrow. (assumption or prediction about a completed action)</p>\n                        <p>Future Perfect Tense ma'lum kelajakdagi vaqt yoki hodisadan oldin harakatning bajarilishini ta'kidlaydi. Bu harakat kelajakda bir nuqtada tugashini bildiradi.</p>\n                    </i>\n                "
            },
            {
                "id": 4,
                "name": "Future Perfect Continuous Tense",
                "content": "\n                    <b>Future Perfect Continuous Tense:</b>\n                    <i>\n                        <p>Ingliz tili grammatikasida Future Perfect Continuous Tense kelajakda ma'lum bir vaqtgacha davom etadigan va shu vaqtgacha tugallanadigan davom etayotgan harakatni tasvirlash uchun ishlatiladi.</p>\n                        <p>Future Perfect Continuous Tense hosil qilish formulasi:</p>\n                        <p class=\"text-primary\">Subject + will have been + present participle of the verb</p>\n                        <p>Future Perfect Continuous Tense misollari:</p>\n                        <p>- <mark>By this time next year</mark>, I will have been working at this company for 10 years.</p>\n                        <p>- <mark>She will have been studying</mark> English for six months by the end of this semester.</p>\n                        <p>- <mark>They will have been traveling</mark> for two days straight when they reach their destination.</p>\n                        <p>Future Perfect Continuous Tense ko'pincha quyidagilar uchun ishlatiladi:</p>\n                        <ul>\n                            <li>Ma'lum bir vaqtgacha davom etadigan davom etayotgan amalning davomiyligini ko'rsating.</li>\n                            <li>Ma'lum bir vaqtgacha davom etadigan va bajariladigan harakatni tavsiflang.</li>\n                            <li>Kelajakdagi amallar haqida taxminlar yoki bashoratlarni bildiring.</li>\n                        </ul>\n                        <p>Misollar:</p>\n                        <p>- <mark>By the time you arrive</mark>, I will have been waiting for two hours. (duration of an ongoing action)</p>\n                    <p>- <mark>She will have been studying</mark> all day by the time her exam starts. (ongoing action before a certain future time)</p>\n                    <p>- <mark>I'm sure they will have been working</mark> hard on this project. (assumption or prediction about an ongoing action)</p>\n                        <p>Future Perfect Continuous Tense davom etayotgan harakatning aniq kelajak vaqtgacha davom etishi va tugallanishini ta'kidlaydi. Bu harakat davom etayotganini va shu vaqtgacha davom etishini bildiradi.</p>\n                    </i>\n                "
            }
        ]
    }
]